# Get company news
# curl "https://news-db-1pgr.onrender.com/news/company/TSLA?limit=15"
# curl "http://localhost:8000/news/company/TSLA?limit=15"
{"symbols":["TSLA"],
    "count":2,
    "news":[{"title":"From pandemic to AI boom: The new reality of global supply chains",
            "summary":"Elon Musk probably said it best when the Tesla (TSLA) CEO declared, “the supply chain stuff is really tricky.” Oh, you’d better believe it. The supply chain—the network of people, organizations, and information that moves a product or service from its origin to the final customer—is crucial ...",
            "published_at":"2025-12-26 03:19:00 EST",
            "symbol":"TSLA",
            "category":"BUSINESS_OPERATIONS",
            "source":"Yahoo",
            "url":"https://finnhub.io/api/news?id=9176d4ecd315b45f743206d3df04c379a566fb4e16262bb8098fda7018b44f46"},{"title":"Tesla Ramps Up Robotaxi Messaging Days Before Musk's Big Deadline","summary":"There are just five days to go for Musk to make good on his promise to remove robotaxi safety monitors.","published_at":"2025-12-26 03:01:02 EST","symbol":"TSLA","category":"CORPORATE_EARNINGS","source":"Yahoo","url":"https://finnhub.io/api/news?id=2b3c7955f3a5f52b4a067bdb8f1a48aa6d532689527aeb76210a81e573e39c5c"}]}


# Request daily summary
# curl https://news-db-1pgr.onrender.com/summary/daily
# curl http://localhost:8000/summary/daily
{"status":"found",
    "summary_date":"2025-12-28",
    "summary_time":"18:00:00",
    "highlight_text":"## Technology\n- **Weebit Nano** (WBT): Secured a license agreement with Texas Instruments (TXN) for ReRAM technology integration, potentially boosting WBT's market presence.\n- **CyberArk** (CYBR): São Paulo-based Absolute Gestao de Investimentos made a $92.23M investment, reflecting confidence in its identity security platform growth.\n\n## Finance\n- **Coatue Management** (Portfolio Update): Q3 2025 13F portfolio rose to $40.79B, with stake increases, decreases, and new positions.\n- **Jerome Powell** (Fed Chair): Warned of 'fairly highly valued' equity prices, suggesting potential market corrections.\n\n## Corporate Actions\n- **OneMain Holdings** (OMF): Gator Capital Management exited its position, driven by portfolio rebalancing.\n- **ANI Pharmaceuticals** (ANI): Stonepine Capital Management exited its position, moving towards earlier-stage biotech.\n- **Energy Transfer** (ET): Recommended as a 8%-yielding dividend stock with potential for growth.\n- **Core & Main**: Tribune Investment Group established a new position post-earnings selloff, indicating long-term value.\n- **Mirum Pharmaceuticals** (MIRU): Eventide Asset Management sold shares but increased position value due to stock surge.\n- **KE Holdings** (BEKE): Perseverance Asset Management International initiated a $12.5M position, betting on strong balance sheet and cash generation.\n\n## Corporate Earnings\n- **Oklo** (OKLO) & **Nano Nuclear Energy** (NNE): May face cash burn challenges and potential dilutive stock sales.\n- **AGNC Investment** (AGNC) vs. **Realty Income** (O): Realty Income is recommended for sustainable dividends over AGNC's volatile yield.\n- **CyberArk** (CYBR): Strong Q3 results with 43% revenue growth and 19% operating margins, outperforming S&P 500.\n\n## Incident & Legal\n- **Inspire Medical Systems** (INSP): Investors encouraged to secure counsel before January 5, 2026, in a securities class action lawsuit.\n- **Alexandria Real Estate Equities** (ARE): Investors encouraged to secure counsel before January 26, 2026, in a securities class action lawsuit.\n- **Bitdeer Technologies Group** (BTDR): Securities class action lawsuit filed for misleading statements about Bitcoin mining technology.\n- **Blue Owl Capital Inc**. (OWL): Investors encouraged to secure counsel before February 2, 2026, in a securities class action lawsuit.\n- **DeFi Technologies** (DEFT): Investors encouraged to secure counsel before January 30, 2026, in a securities class action lawsuit.\n- **Integer Holdings Corporation** (ITGR): Securities class action lawsuit filed for misleading statements about competitive position in electrophysiology market.\n- **Charming Medical Limited** (MCTA): Investors encouraged to join a securities fraud lawsuit with a February 17, 2026, deadline.\n- **Jayud Global Logistics Ltd**. (JYD): Securities class action lawsuit filed for fraudulent stock promotion schemes.\n- **Klarna Group plc** (KLAR): Class action lawsuit filed for false and misleading statements in its September 2025 IPO.\n- **Perrigo Company plc** (PRGO): Securities class action lawsuit filed for false statements regarding Nestlé infant formula acquisition.",
    "news_count":22,
    "updated_at":"2025-12-29T03:56:13.189342"}

# curl https://news-db-1pgr.onrender.com/summary/TSLA    

{"status":"found",
"company":"Tesla Inc.",
"symbol":"TSLA",
"summary_date":"2025-12-31",
"summary_time":"18:00:00",
"highlight_text":"Tesla Inc. (TSLA) experienced mixed developments in the final days of 2025. Elon Musk's xAI expanded its AI compute power with a third data center purchase, signaling a boost in Colossus supercomputer capabilities. However, Tesla's delivery estimates indicated a lower sales outlook for the fourth quarter, with a potential second consecutive annual decline. The company's supplier L&F restructured a contract, impacting Cybertruck orders and the supplier's shares. Despite a successful DHL Tesla Semi pilot, concerns over supply issues and the robotaxi promise contributed to a dip in Tesla stock. Meanwhile, Musk claimed the Tesla Model Y as the world's bestselling vehicle for the third year in a row, though data suggests a potential decline in sales and a dispute with Grok AI over the top-selling vehicle status.",
"news_count":8,
"updated_at":"2026-01-01T02:35:15.534572"}